#### WorksetPreview Members

---

|  |
| --- |
| WorksetPreview Class   Methods   Properties   See Also |

The  WorksetPreview  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  WorksetPreview |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Id | Id of the workset. |
| Public property | IsDefaultWorkset | Whether the workset is the default one. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | Name of the workset. |
| Public property | Owner | User name of the workset. |
| Public property | UniqueId | UniqueId of the workset. |

# See Also

WorksetPreview Class

Autodesk.Revit.DB Namespace